Table of Contents
 Interface IIdeaWeld
Namespace
IdeaStatiCa.BimApi
Assembly
IdeaStatiCa.BimApi.dll
An weld is a part of a connection.
public interface IIdeaWeld : IIdeaPersistentObject, IIdeaObject
Inherited Members
 IIdeaPersistentObject.Token
 IIdeaObject.Id
 IIdeaObject.Name
Properties
 ConnectedParts
Collection of part witch should be welded
IEnumerable<IIdeaObjectConnectable> ConnectedParts { get; }
Property Value
IEnumerable<IIdeaObjectConnectable>
 End
End node of the weld line. Could be same as start point
IIdeaNode End { get; }
Property Value
IIdeaNode
 Material
Material of the plate.
IIdeaMaterial Material { get; }
Property Value
IIdeaMaterial
 Start
Start node of the weld line.
IIdeaNode Start { get; }
Property Value
IIdeaNode
 Thickness
double Thickness { get; set; }
Property Value
double
 WeldType
Type of weld
WeldType WeldType { get; }
Property Value
WeldType
 Edit this page